A622266/micropython/ports/mimxrt/machine_spi.c
#define CLOCK_DIVIDER           (1)

#if defined(MIMXRT117x_SERIES)
#define LPSPI_DMAMUX            DMAMUX0
#else
#define LPSPI_DMAMUX            DMAMUX
#endif

#define MICROPY_HW_SPI_NUM MP_ARRAY_SIZE(spi_index_table)

#define SCK (iomux_table[index])
#define CS0 (iomux_table[index + 1])
#define SDO (iomux_table[index + 2])
#define SDI (iomux_table[index + 3])
#define CS1 (iomux_table[index + 4])

// TMR2 channel 0 is dedicated as the periodic-DMA trigger for ALL SPI(id) objects that
// use dma_periodic_start() -- this project only ever needs one such stream at a time
// (the DDS phase path), so no per-instance allocation is implemented. TMR3 channel 3 is
// dedicated as the I/O_UPDATE pulse generator, chosen because it's the only TMR channel
// with a native mux to pin D15 (see the module-level comment above).
// Trigger mechanism (2026-09-06, revised): NOT QTMR2 anymore -- bench-tested and found
// that QTMR's "Comparator Preload" DMA request is tied to the CMPLD1->COMP1 double-
// buffered reload mechanism (a producer/consumer relationship for auto-updating a
// compare value via DMA), not a bare "period elapsed" pulse; nothing ever primed
// CMPLD1, so the request never fired (confirmed via a dedicated ISR-count diagnostic:
// zero interrupts over a 30s run despite the DDS output looking stable -- that stability
// was just the initial blocking-write priming value, latched and held, never actually
// refreshed by DMA).
//
// Replaced with PIT + XBARA1, verified against the device header (not assumed):
// PIT_StartTimer()'s own doc says a channel "generates a trigger pulse" unconditionally
// every time it reaches 0 -- no compare/capture/reload complexity attached, this is
// PIT's entire purpose. That trigger has no direct DMAMUX entry (confirmed earlier --
// PIT and GPT are both absent from dma_request_source_t), but XBARA1 has a dedicated
// input for it (kXBARA1_InputPitTrigger0, MIMXRT1062.h) which can be routed to one of
// XBARA1's 4 DMAMUX-facing outputs (kXBARA1_OutputDmaChMuxReq30, matching DMAMUX's own
// kDmaRequestMuxXBAR1Request0 -- confirmed these are the same physical signal by cross-
// referencing the request-number in both enums' comments). PIT channel 0, XBARA1 output
// 0 chosen; nothing else in this codebase uses either.
#define SPI_DMA_PIT_CHANNEL         kPIT_Chnl_0
#define SPI_DMA_XBAR_INPUT          kXBARA1_InputPitTrigger0
#define SPI_DMA_XBAR_OUTPUT         kXBARA1_OutputDmaChMuxReq30
#define SPI_DMA_DMAMUX_SRC          kDmaRequestMuxXBAR1Request0
#define SPI_DMA_IO_UPDATE_TMR_BASE  TMR3
#define SPI_DMA_IO_UPDATE_CHANNEL   kQTMR_Channel_3

// Ring buffer size: two equal halves, refilled one half at a time while the DMA engine
// drains the other -- same double-buffering shape as machine_i2s.c's SIZEOF_DMA_BUFFER_
// IN_BYTES/feed_dma() pattern, sized in frames rather than assumed a fixed byte count
// since frame_bytes is caller-specified (5 bytes for an AD9952/9954-style FTW0 write, 8
// for an AD9910 Profile 0 write, etc.).
#define SPI_DMA_FRAMES_PER_HALF (64)

typedef struct _machine_spi_obj_t {
    mp_obj_base_t base;
    uint8_t spi_id;
    uint8_t mode;
    uint8_t spi_hw_id;
    bool transfer_busy;
    LPSPI_Type *spi_inst;
    lpspi_master_config_t *master_config;

    // --- periodic DMA extension state; all zero/NULL unless dma_periodic_start() has
    // been called on this object. See the module-level comment block above.
    bool dma_periodic_active;
    size_t dma_frame_bytes;
    uint8_t *dma_buffer;                 // 2 * SPI_DMA_FRAMES_PER_HALF * dma_frame_bytes,
                                          // allocated at dma_periodic_start() time
    uint8_t *dma_buffer_dcache_aligned;
    int dma_channel;
    edma_handle_t dma_edmaHandle;
    edma_tcd_t *dma_edmaTcd;
    mp_obj_t dma_refill_callback;         // called via mp_sched_schedule(cb, half_index)
} machine_spi_obj_t;

typedef struct _iomux_table_t {
    uint32_t muxRegister;
    uint32_t muxMode;
    uint32_t inputRegister;
    uint32_t inputDaisy;
    uint32_t configRegister;
} iomux_table_t;

static const uint8_t spi_index_table[] = MICROPY_HW_SPI_INDEX;
static LPSPI_Type *spi_base_ptr_table[] = LPSPI_BASE_PTRS;
static const iomux_table_t iomux_table[] = {
    IOMUX_TABLE_SPI
};

bool lpspi_set_iomux(int8_t spi, uint8_t drive, int8_t cs) {
    int index = (spi - 1) * 5;

    if (SCK.muxRegister != 0) {
        IOMUXC_SetPinMux(SCK.muxRegister, SCK.muxMode, SCK.inputRegister, SCK.inputDaisy, SCK.configRegister, 0U);
        IOMUXC_SetPinConfig(SCK.muxRegister, SCK.muxMode, SCK.inputRegister, SCK.inputDaisy, SCK.configRegister,
            pin_generate_config(PIN_PULL_UP_100K, PIN_MODE_OUT, drive, SCK.configRegister));

        if (cs == 0 && CS0.muxRegister != 0) {
            IOMUXC_SetPinMux(CS0.muxRegister, CS0.muxMode, CS0.inputRegister, CS0.inputDaisy, CS0.configRegister, 0U);
            IOMUXC_SetPinConfig(CS0.muxRegister, CS0.muxMode, CS0.inputRegister, CS0.inputDaisy, CS0.configRegister,
                pin_generate_config(PIN_PULL_UP_100K, PIN_MODE_OUT, drive, CS0.configRegister));
        } else if (cs == 1 && CS1.muxRegister != 0) {
            IOMUXC_SetPinMux(CS1.muxRegister, CS1.muxMode, CS1.inputRegister, CS1.inputDaisy, CS1.configRegister, 0U);
            IOMUXC_SetPinConfig(CS1.muxRegister, CS1.muxMode, CS1.inputRegister, CS1.inputDaisy, CS1.configRegister,
                pin_generate_config(PIN_PULL_UP_100K, PIN_MODE_OUT, drive, CS1.configRegister));
        } else if (cs != -1) {
            mp_raise_ValueError(MP_ERROR_TEXT("The chosen CS is not available"));
        }

        IOMUXC_SetPinMux(SDO.muxRegister, SDO.muxMode, SDO.inputRegister, SDO.inputDaisy, SDO.configRegister, 0U);
        IOMUXC_SetPinConfig(SDO.muxRegister, SDO.muxMode, SDO.inputRegister, SDO.inputDaisy, SDO.configRegister,
            pin_generate_config(PIN_PULL_UP_100K, PIN_MODE_OUT, drive, SDO.configRegister));

        IOMUXC_SetPinMux(SDI.muxRegister, SDI.muxMode, SDI.inputRegister, SDI.inputDaisy, SDI.configRegister, 0U);
        IOMUXC_SetPinConfig(SDI.muxRegister, SDI.muxMode, SDI.inputRegister, SDI.inputDaisy, SDI.configRegister,
            pin_generate_config(PIN_PULL_UP_100K, PIN_MODE_IN, drive, SDI.configRegister));

