A622266/micropython/ports/mimxrt/machine_spi.c
        lpspi_transfer_t masterXfer;
        masterXfer.txData = (uint8_t *)src;
        masterXfer.rxData = (uint8_t *)dest;
        masterXfer.dataSize = len;
        masterXfer.configFlags = (self->master_config->whichPcs << LPSPI_MASTER_PCS_SHIFT) | kLPSPI_MasterPcsContinuous | kLPSPI_MasterByteSwap;

        if (LPSPI_MasterTransferBlocking(self->spi_inst, &masterXfer) != kStatus_Success) {
            mp_raise_OSError(EIO);
        }
    }
}

// Forward declaration -- defined further down with the rest of the periodic-DMA
// implementation, but must be wired into machine_spi_p (right below) so a plain
// spi.deinit() (or garbage collection reclaiming an abandoned SPI object -- a real
// scenario given this project's habit of re-running bench scripts repeatedly in the
// same mpremote/REPL session) actually releases the DMA channel and stops both QTMR
// channels, instead of leaking them silently. Before this, machine_spi_p had no .deinit
// at all (generic machine_spi_deinit() in extmod/machine_spi.c already no-ops when it's
// NULL) -- a pre-existing gap this patch also closes as a side effect.
static void machine_spi_deinit_hw(mp_obj_base_t *self_in);

static const mp_machine_spi_p_t machine_spi_p = {
    .init = machine_spi_init,
    .deinit = machine_spi_deinit_hw,
    .transfer = machine_spi_transfer,
};

// --- Periodic DMA transfer implementation ---
// See the module-level comment block near the top of this file for the verified
// hardware facts this depends on, and what's still open.

// TCD storage for the periodic-DMA channel. Only one SPI(id) can run dma_periodic_start()
// at a time in this implementation (see SPI_DMA_PIT_CHANNEL's own comment), so a single
// static TCD suffices -- mirrors machine_i2s.c's AT_NONCACHEABLE_SECTION_ALIGN(edma_tcd_t
// edmaTcd[I2S_NUM_OBJ_SLOTS], 32) pattern, sized 1 instead of I2S_NUM_OBJ_SLOTS.
AT_NONCACHEABLE_SECTION_ALIGN(static edma_tcd_t spi_dma_tcd, 32);

// Diagnostic-only counter (2026-09-06): increments unconditionally, at ISR level, every
// time this callback runs at all -- independent of whether mp_sched_schedule() actually
// gets serviced by the Python side. Used to separate "the eDMA interrupt never fires" from
// "it fires but the scheduled Python callback never runs" after a sweep test found
// refill() only ever called twice (the initial manual primes) in a 30s run.
volatile uint32_t spi_dma_isr_count = 0;

static void edma_spi_periodic_callback(edma_handle_t *handle, void *userData, bool transferDone, uint32_t tcds) {
    spi_dma_isr_count++;
    machine_spi_obj_t *self = (machine_spi_obj_t *)userData;
    if (self->dma_refill_callback != MP_OBJ_NULL && self->dma_refill_callback != mp_const_none) {
        // transferDone == true means the eDMA major loop just wrapped, i.e. the bottom
        // half was the one just drained (mirrors edma_i2s_callback's own TOP_HALF/
        // BOTTOM_HALF convention in machine_i2s.c) -- pass which half needs refilling,
        // not which half just played, so the Python-side callback can call
        // dma_periodic_write() directly on the right half without re-deriving this.
        mp_sched_schedule(self->dma_refill_callback,
            MP_OBJ_NEW_SMALL_INT(transferDone ? 0 : 1));
    }
}

// Same clock-query + prescale-search recipe as machine_pwm.c's configure_qtmr()/
// calc_prescaler() (CLOCK_GetFreq(kCLOCK_IpgClk), not a hardcoded frequency) -- see the
// module comment's note on why this must be computed, not assumed.
static int spi_dma_calc_qtmr_prescale(uint32_t clock_hz, uint32_t rate_hz, uint16_t *ticks_out) {
    for (int prescale = 0; prescale < 8; prescale++) {
        uint32_t divided = clock_hz >> prescale;
        uint32_t ticks = divided / rate_hz;
        if (ticks <= 0xFFFF && ticks > 0) {
            *ticks_out = (uint16_t)ticks;
            return prescale;
        }
    }
    return -1; // rate_hz too low to represent even at maximum prescale
}

// spi.dma_periodic_start(frame_bytes, rate_hz, refill_callback, io_update_duty_u16=0,
//                         io_update_phase_ticks=0)
//
// Starts a QTMR2/eDMA-driven periodic transfer of `frame_bytes`-sized frames from an
// internal double-buffer into this SPI object's LPSPI TDR register at `rate_hz`, and a
// TMR3-channel-3 hardware PWM pulse on pin D15 (I/O_UPDATE) at the same rate.
// `refill_callback(half)` is scheduled (via mp_sched_schedule, i.e. run on the main
// thread, not from IRQ context) each time a half-buffer has just been drained and needs
// fresh frames written into it via dma_periodic_write(half, buf).
//
// `io_update_duty_u16`/`io_update_phase_ticks` are NOT yet bench-validated -- see the
// module comment's open-items list. Passing 0 for both currently means "no I/O_UPDATE
// pulse is generated," i.e. this call alone is NOT sufficient for a working DDS update
// path yet; it must be paired with a bench session to find real values for these before
// the AD9910 will actually latch anything written here. Left as explicit, required
// arguments rather than a guessed default specifically so that gap is visible at every
// call site, not hidden behind a silently-wrong default.
static mp_obj_t machine_spi_dma_periodic_start(size_t n_args, const mp_obj_t *args) {
    machine_spi_obj_t *self = MP_OBJ_TO_PTR(args[0]);
    mp_int_t frame_bytes = mp_obj_get_int(args[1]);
    mp_int_t rate_hz = mp_obj_get_int(args[2]);
    mp_obj_t refill_callback = args[3];
    mp_int_t io_update_duty_u16 = (n_args > 4) ? mp_obj_get_int(args[4]) : 0;
    mp_int_t io_update_phase_ticks = (n_args > 5) ? mp_obj_get_int(args[5]) : 0;
    (void)io_update_phase_ticks;  // accepted but not yet wired to anything -- see the
                                  // module comment's open-items list on I/O_UPDATE phase

    if (self->dma_periodic_active) {
        mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("dma_periodic already active"));
    }
    if (frame_bytes <= 0 || frame_bytes > 16) {
        mp_raise_ValueError(MP_ERROR_TEXT("frame_bytes out of range"));
    }

