A622266/micropython/ports/mimxrt/machine_spi.c
    self->dma_frame_bytes = (size_t)frame_bytes;
    size_t half_bytes = SPI_DMA_FRAMES_PER_HALF * self->dma_frame_bytes;
    size_t total_bytes = 2 * half_bytes;

    // +0x1f for D-cache-line alignment slack, same as machine_i2s.c's dma_buffer field;
    // AT_NONCACHEABLE_SECTION_ALIGN is not used here because size is only known at this
    // point (frame_bytes is caller-specified), unlike the fixed-size TCD above -- this
    // buffer instead needs an explicit cache-maintenance call before each DMA-visible
    // write -- confirmed necessary by bench test (2026-09-06): a frequency-sweep test
    // wrote genuinely changing content via dma_periodic_write() on every refill (verified
    // via the Teensy's own debug log), but the DDS output never changed, stuck at
    // whatever the very first write happened to leave in RAM -- exactly the D-cache
    // staleness this TODO predicted (CPU writes land in cache, DMA reads RAM directly,
    // never sees the update without an explicit clean).
    self->dma_buffer = m_new(uint8_t, total_bytes + 0x1f);
    self->dma_buffer_dcache_aligned = (uint8_t *)(((uint32_t)self->dma_buffer + 0x1f) & ~0x1f);
    memset(self->dma_buffer_dcache_aligned, 0, total_bytes);
    DCACHE_CleanByRange((uint32_t)self->dma_buffer_dcache_aligned, (uint32_t)total_bytes);

    self->dma_refill_callback = refill_callback;

    uint32_t ipg_clk_hz = CLOCK_GetFreq(kCLOCK_IpgClk);

    // --- PIT channel 0: unconditional periodic trigger pulse, routed via XBARA1 into
    // DMAMUX. See SPI_DMA_PIT_CHANNEL's own comment above for why this replaced QTMR2.
    pit_config_t pit_config;
    PIT_GetDefaultConfig(&pit_config);
    PIT_Init(PIT, &pit_config);
    uint32_t perclk_hz = CLOCK_GetPerClkFreq();
    uint32_t pit_ticks = perclk_hz / (uint32_t)rate_hz;
    if (pit_ticks == 0) {
        mp_raise_ValueError(MP_ERROR_TEXT("rate_hz too high to represent on PIT"));
    }
    PIT_SetTimerPeriod(PIT, SPI_DMA_PIT_CHANNEL, pit_ticks);

    XBARA_Init(XBARA1);
    XBARA_SetSignalsConnection(XBARA1, SPI_DMA_XBAR_INPUT, SPI_DMA_XBAR_OUTPUT);
    xbara_control_config_t xbar_ctrl_config = {
        .activeEdge = kXBARA_EdgeRising,
        .requestType = kXBARA_RequestDMAEnable,
    };
    XBARA_SetOutputSignalConfig(XBARA1, SPI_DMA_XBAR_OUTPUT, &xbar_ctrl_config);

    // --- TMR3 channel 3 / pin D15: I/O_UPDATE pulse, ordinary hardware PWM. Still QTMR-
    // based -- this part is unrelated to the trigger-mechanism swap above and unchanged.
    // TODO(bench): io_update_duty_u16/io_update_phase_ticks are passed through
    // uninterpreted below beyond what QTMR_SetupPwm_u16 itself does with a duty value --
    // the phase relationship to the SPI-triggering PIT channel is NOT yet established
    // by this code (PIT and TMR3 are simply started independently below; nothing here
    // guarantees a specific relative phase). This is the single biggest unproven piece
    // of this patch -- do not trust I/O_UPDATE timing without an ADALM2000 capture.
    if (io_update_duty_u16 > 0) {
        IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_03_QTIMER3_TIMER3, 0U);
        uint16_t io_update_ticks;
        int prescale = spi_dma_calc_qtmr_prescale(ipg_clk_hz, (uint32_t)rate_hz, &io_update_ticks);
        if (prescale < 0) {
            mp_raise_ValueError(MP_ERROR_TEXT("rate_hz too low to represent"));
        }
        qtmr_config_t io_update_config;
        QTMR_GetDefaultConfig(&io_update_config);
        io_update_config.primarySource = (qtmr_primary_count_source_t)(prescale + kQTMR_ClockDivide_1);
        QTMR_Init(SPI_DMA_IO_UPDATE_TMR_BASE, SPI_DMA_IO_UPDATE_CHANNEL, &io_update_config);
        QTMR_SetupPwm_u16(SPI_DMA_IO_UPDATE_TMR_BASE, SPI_DMA_IO_UPDATE_CHANNEL,
            (uint32_t)rate_hz, (uint16_t)io_update_duty_u16, false,
            ipg_clk_hz / (1u << prescale), false);
        QTMR_StartTimer(SPI_DMA_IO_UPDATE_TMR_BASE, SPI_DMA_IO_UPDATE_CHANNEL, kQTMR_PriSrcRiseEdge);
    }

    // --- LPSPI frame-size fixup: a single AD9910/9952/9954 register write is one
    // instruction byte + N payload bytes inside ONE continuous chip-select-low window
    // (the datasheet's own serial-port timing diagram), not N+1 separate one-byte
    // transactions. Left at whatever FRAMESZ a normal machine.SPI.write() call last
    // configured (LPSPI defaults effectively to one CS pulse per 8 bits), the DMA path
    // below would toggle PCS after every single byte instead of once per whole frame --
    // almost certainly misinterpreted by the DDS as N+1 separate short writes rather
    // than one real register write. Fixed by widening just the FRAMESZ field so hardware
    // holds PCS low across the whole frame_bytes*8-bit frame, auto-toggling it only
    // between frames.
    //
    // Deliberately a read-modify-write of TCR's existing value, not a from-scratch
    // reconstruction: TCR also carries CPOL/CPHA/PRESCALE/PCS-select/byte-swap, and
    // LPSPI_MasterInit() does not appear to fully populate TCR itself (those fields seem
    // to only get set for real when a transfer actually runs) -- so this call has a real
    // PRECONDITION: at least one ordinary spi.write()/write_readinto() must already have
    // succeeded on this object before dma_periodic_start() is called, so TCR already
    // holds this project's correct working CPOL/CPHA/byte-order configuration from that
    // call, and this code only widens FRAMESZ on top of it rather than guessing those
    // other fields from scratch (guessing PRESCALE's encoding or BYSW independently was
    // judged a worse risk than requiring this precondition). NOT bench-verified that this
    // read-modify-write approach actually produces correct multi-byte bit ordering on the
    // wire -- see the module comment's open-items list; capture with the ADALM2000 and
    // compare against a known-good blocking-mode write of the same register before
    // trusting this.
    uint32_t frame_bits = (uint32_t)self->dma_frame_bytes * 8;
    self->spi_inst->TCR = (self->spi_inst->TCR & ~LPSPI_TCR_FRAMESZ_MASK) | LPSPI_TCR_FRAMESZ(frame_bits - 1);

    // --- eDMA: QTMR2-triggered, ring buffer -> LPSPI TDR, self-linked TCD for
    // continuous circular operation (same construct machine_i2s.c uses).
    self->dma_channel = allocate_dma_channel();
    if (self->dma_channel < 0) {
        mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("no DMA channel available"));
    }
    DMAMUX_Init(DMAMUX);
    DMAMUX_SetSource(DMAMUX, self->dma_channel, SPI_DMA_DMAMUX_SRC);
    DMAMUX_EnableChannel(DMAMUX, self->dma_channel);

