A622266/micropython/ports/mimxrt/machine_spi.c
    // Idempotent (guarded internally) -- must still be called here rather than assumed
    // already done by some other peripheral's constructor (e.g. machine_i2s.c's own
    // i2s_init() also calls this), since this SPI object may be the first DMA user.
    dma_init();
    EDMA_CreateHandle(&self->dma_edmaHandle, DMA0, self->dma_channel);
    EDMA_SetCallback(&self->dma_edmaHandle, edma_spi_periodic_callback, self);
    EDMA_ResetChannel(DMA0, self->dma_channel);
    self->dma_edmaTcd = &spi_dma_tcd;

    // Per-beat transfer width MUST be a real eDMA SSIZE/DSIZE encoding (1/2/4/8/16/32
    // bytes) -- dma_frame_bytes (e.g. 9 for an AD9910 write) is NOT a valid width and an
    // earlier version of this patch wrongly passed it as one. Fixed: beats are always
    // 1 byte wide; dma_frame_bytes instead sets the MINOR LOOP byte count (how many
    // 1-byte beats fire back-to-back per single QTMR-sourced DMA request) -- this is the
    // standard eDMA minor-loop/major-loop split, not a workaround.
    edma_transfer_config_t transferConfig;
    EDMA_PrepareTransfer(&transferConfig,
        self->dma_buffer_dcache_aligned, 1,
        (void *)&self->spi_inst->TDR, 1,
        (uint32_t)self->dma_frame_bytes,     // minor loop: one whole frame per QTMR tick
        (uint32_t)total_bytes,               // major loop: whole ring buffer
        kEDMA_MemoryToPeripheral);
    memset(self->dma_edmaTcd, 0, sizeof(edma_tcd_t));
    EDMA_TcdSetTransferConfig(self->dma_edmaTcd, &transferConfig, self->dma_edmaTcd);
    EDMA_TcdEnableInterrupts(self->dma_edmaTcd, kEDMA_MajorInterruptEnable | kEDMA_HalfInterruptEnable);
    EDMA_InstallTCD(DMA0, self->dma_channel, self->dma_edmaTcd);
    EDMA_StartTransfer(&self->dma_edmaHandle);

    PIT_StartTimer(PIT, SPI_DMA_PIT_CHANNEL);

    self->dma_periodic_active = true;
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_spi_dma_periodic_start_obj, 4, 6, machine_spi_dma_periodic_start);

// spi.dma_periodic_write(half, buf) -- copy buf (must be exactly SPI_DMA_FRAMES_PER_HALF
// * frame_bytes long) into the specified half (0=bottom, 1=top) of the internal ring
// buffer. Intended to be called from the refill_callback passed to
// dma_periodic_start(), using the `half` value that callback was invoked with.
static mp_obj_t machine_spi_dma_periodic_write(mp_obj_t self_in, mp_obj_t half_in, mp_obj_t buf_in) {
    machine_spi_obj_t *self = MP_OBJ_TO_PTR(self_in);
    mp_int_t half = mp_obj_get_int(half_in);
    if (!self->dma_periodic_active) {
        mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("dma_periodic not active"));
    }
    mp_buffer_info_t buf;
    mp_get_buffer_raise(buf_in, &buf, MP_BUFFER_READ);
    size_t half_bytes = SPI_DMA_FRAMES_PER_HALF * self->dma_frame_bytes;
    if (buf.len != half_bytes) {
        mp_raise_ValueError(MP_ERROR_TEXT("buffer wrong length for one half"));
    }
    uint8_t *dest = self->dma_buffer_dcache_aligned + (half ? half_bytes : 0);
    memcpy(dest, buf.buf, half_bytes);
    // Confirmed necessary by bench test (2026-09-06) -- see dma_periodic_start()'s own
    // comment. Without this, DMA silently keeps reading whatever stale content was in
    // RAM before this call, ignoring every refill.
    DCACHE_CleanByRange((uint32_t)dest, (uint32_t)half_bytes);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_3(machine_spi_dma_periodic_write_obj, machine_spi_dma_periodic_write);

// Diagnostic-only (2026-09-06): see spi_dma_isr_count's own comment above.
static mp_obj_t machine_spi_dma_periodic_isr_count(mp_obj_t self_in) {
    (void)self_in;
    return mp_obj_new_int_from_uint(spi_dma_isr_count);
}
static MP_DEFINE_CONST_FUN_OBJ_1(machine_spi_dma_periodic_isr_count_obj, machine_spi_dma_periodic_isr_count);

static mp_obj_t machine_spi_dma_periodic_stop(mp_obj_t self_in) {
    machine_spi_obj_t *self = MP_OBJ_TO_PTR(self_in);
    if (!self->dma_periodic_active) {
        return mp_const_none;
    }
    EDMA_AbortTransfer(&self->dma_edmaHandle);
    free_dma_channel(self->dma_channel);
    PIT_StopTimer(PIT, SPI_DMA_PIT_CHANNEL);
    QTMR_StopTimer(SPI_DMA_IO_UPDATE_TMR_BASE, SPI_DMA_IO_UPDATE_CHANNEL);
    self->dma_periodic_active = false;
    self->dma_refill_callback = MP_OBJ_NULL;
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(machine_spi_dma_periodic_stop_obj, machine_spi_dma_periodic_stop);

static void machine_spi_deinit_hw(mp_obj_base_t *self_in) {
    machine_spi_dma_periodic_stop(MP_OBJ_FROM_PTR(self_in));
}

// --- Port-specific locals dict: the generic mp_machine_spi_locals_dict (extmod/
// machine_spi.c) has no way to carry these mimxrt-only additions, so this file defines
// its own dict combining the generic entries with the three new methods above, and
// points machine_spi_type at THIS dict instead. The extern declarations below assume
// external linkage for the generic *_obj symbols -- consistent with how
// MP_DEFINE_CONST_FUN_OBJ_* is used elsewhere in this codebase, but NOT bench/build-
// verified for this exact case; a build failure here would mean extmod/machine_spi.c
// needs those symbols marked non-static (a one-line, upstream-friendly fix) rather than
// anything wrong with this file's own logic.
// mp_machine_spi_{read,readinto,write,write_readinto}_obj are already declared (with the
// correct types -- read/readinto as mp_obj_fun_builtin_var_t, write/write_readinto as
// mp_obj_fun_builtin_fixed_t) by extmod/modmachine.h, already transitively included via
// py/runtime.h above -- redeclaring them here with guessed types was a real build error
// (conflicting types for mp_machine_spi_write_obj), not just redundant. Only
// machine_spi_init_obj/machine_spi_deinit_obj need a fresh extern here: modmachine.h
// doesn't declare them (they were static in extmod/machine_spi.c until this patch).
extern const mp_obj_fun_builtin_var_t machine_spi_init_obj;    // MP_DEFINE_CONST_FUN_OBJ_KW
extern const mp_obj_fun_builtin_fixed_t machine_spi_deinit_obj; // MP_DEFINE_CONST_FUN_OBJ_1

static const mp_rom_map_elem_t machine_spi_mimxrt_locals_dict_table[] = {
    { MP_ROM_QSTR(MP_QSTR_init), MP_ROM_PTR(&machine_spi_init_obj) },
    { MP_ROM_QSTR(MP_QSTR_deinit), MP_ROM_PTR(&machine_spi_deinit_obj) },
    { MP_ROM_QSTR(MP_QSTR_read), MP_ROM_PTR(&mp_machine_spi_read_obj) },
    { MP_ROM_QSTR(MP_QSTR_readinto), MP_ROM_PTR(&mp_machine_spi_readinto_obj) },
    { MP_ROM_QSTR(MP_QSTR_write), MP_ROM_PTR(&mp_machine_spi_write_obj) },
    { MP_ROM_QSTR(MP_QSTR_write_readinto), MP_ROM_PTR(&mp_machine_spi_write_readinto_obj) },
    { MP_ROM_QSTR(MP_QSTR_MSB), MP_ROM_INT(MICROPY_PY_MACHINE_SPI_MSB) },
    { MP_ROM_QSTR(MP_QSTR_LSB), MP_ROM_INT(MICROPY_PY_MACHINE_SPI_LSB) },
    { MP_ROM_QSTR(MP_QSTR_dma_periodic_start), MP_ROM_PTR(&machine_spi_dma_periodic_start_obj) },
    { MP_ROM_QSTR(MP_QSTR_dma_periodic_write), MP_ROM_PTR(&machine_spi_dma_periodic_write_obj) },
    { MP_ROM_QSTR(MP_QSTR_dma_periodic_stop), MP_ROM_PTR(&machine_spi_dma_periodic_stop_obj) },
    { MP_ROM_QSTR(MP_QSTR_dma_periodic_isr_count), MP_ROM_PTR(&machine_spi_dma_periodic_isr_count_obj) },
};
MP_DEFINE_CONST_DICT(mp_machine_spi_mimxrt_locals_dict, machine_spi_mimxrt_locals_dict_table);

MP_DEFINE_CONST_OBJ_TYPE(
    machine_spi_type,
    MP_QSTR_SPI,
    MP_TYPE_FLAG_NONE,
    make_new, machine_spi_make_new,
    print, machine_spi_print,
    protocol, &machine_spi_p,
    locals_dict, &mp_machine_spi_mimxrt_locals_dict
    );
